Tekla Open API Reference for Tekla Structures 2025
LineTypeAttributes Properties
The LineTypeAttributes type exposes the following members.
Properties
Name | Description
Color
 The color of the line (see DrawingColors for options).
TrueColor
 The true color (rgb enabled) of the line.
Type
 The type of the line (see LineTypes for options).
Top
See Also
Reference
LineTypeAttributes Class
Tekla.Structures.Drawing Namespace